function solve(arr1,arr2){
    //създавам празен трети масив
    let arr3=[];
    //завъртаме цикъл в който ще направим всички сметки
    for(i=0;i<arr1.length;i++){
            if(i%2==0){  
                //пресмятане на сумата като елементите се превръщат в числа защото инече ще ни ги конкатенира понеже е низ
                let sum=Number(arr1[i])+Number(arr2[i])
                //поставяме елемента във масива
                arr3.push(sum);
            }else{
                //ако горното условие не е изпълнено конкатенираме елементите във една променлива
                let concat=arr1[i]+arr2[i];
                //поставяме конкатенираният вече елемент в масива
                arr3.push(concat)
            }
        }
    console.log(arr3.join(` - `))
}
solve(['5', '15', '23', '56', '35'],
['17', '22', '87', '36', '11']
)